import React from 'react'
import { Link } from 'react-router-dom';
import { motion } from 'framer-motion'
import s from './Practice.module.scss'
import Footer from '../../components/Footer/Footer';
import SideBar from '../../components/NavSideBar/SideBar';
import { useState } from 'react';


const textAnimation = {
    hidden: {
        y: -100,
        opacity: 0,
    },
    visible: custom => ({
        y: 0,
        opacity: 1,
        transition: { delay: custom * 0.3 },

    }),
}


export default function Practice() {
    const [expandedCountry, setExpandedCountry] = useState(false);

    const toggleExpansion = (index) => {
        if (expandedCountry === index) {
            setExpandedCountry(false); // Закрыть информацию, если уже открыта
        } else {
            setExpandedCountry(index); // Открыть информацию для выбранной страны
        }
    };

    const isCountryExpanded = (index) => {
        return expandedCountry === index;
    };
    const countries = [
        {
            name: 'ОАЭ',
            info:
                'ОАЭ является одним из наиболее динамично развивающихся регионов мира, что предоставляет бизнесу множество возможностей для роста и развития.',
            localizationName: 'Локализация в ОАЭ:',
            localization: [
                'Консультации по вопросам законодательства и налогообложения ОАЭ, а также по процедуре регистрации и лицензирования бизнеса;',
                'Подготовка документов для регистрации компании в ОАЭ, включая оформление учредительных документов, регистрацию и получение необходимых лицензий и разрешений;',
                'Помощь в поиске и выборе подходящего офиса (включая flexi-desk офисы) или склада для бизнеса;',
                'Подготовка договоров с поставщиками, партнерами и клиентами;',
                'Консультации по вопросам трудового законодательства, а также помощь в оформлении рабочих виз и разрешений на работу для иностранных сотрудников;',
                'Получение и переоформление Emirates ID;',
                'Юридическая поддержка при сделках с недвижимостью и инвестициях;',
                'Помощь в открытии банковских счетов и обслуживании банковских операций;',
                'Юридическая поддержка при решении споров с государственными органами или другими компаниями в ОАЭ.',
            ],
        },
        {
            name: 'Казахстан',
            info:
                'Казахстан – одна из немногих юрисдикций, открытых для российского капитала и транзита товаров, благодаря наличию единого таможенного пространства (ТС), а также широкой общей сухопутной границе с Россией. Русский язык является официальным. Местное законодательство имеет высокую степень преемственности от норм российского права.',
            localizationName: 'Локализация в Казахстане:',
            localization: [
                'Консультации по вопросам местного законодательства, включая вопросы регистрации и ведения бизнеса;',
                'Подготовка документов для регистрации компании в Казахстане, включая оформление учредительных документов, регистрацию и получение необходимых разрешений;',
                'Помощь в поиске и выборе подходящего офиса или склада для бизнеса;',
                'Подготовка договоров с поставщиками, партнерами и клиентами, включая международные поставки и дилерские контракты;',
                'Помощь в открытии банковских счетов и обслуживании банковских операций;',
                'Помощь в локализации на территории свободных экономических зон Казахстана;',
                'Юридическая поддержка при решении споров с государственными органами или другими компаниями в Казахстане.',
            ],
        },
        {
            name: 'Узбекистан',
            info:
                'Узбекистан – наиболее дружественная к России юрисдикция в Центральной Азии, имеющая к тому же динамично развивающуюся экономику при низкой базе, что обеспечивает кратные показатели роста в бизнесе в текущих условиях.',
            localizationName: 'Локализация в Узбекистане:',
            localization: [
                'Консультации по вопросам местного законодательства, включая вопросы регистрации и ведения бизнеса;',
                'Подготовка документов для регистрации компании в Узбекистане, включая оформление учредительных документов, регистрацию и получение необходимых разрешений;',
                'Помощь в поиске и выборе подходящего офиса или склада для бизнеса;',
                'Подготовка договоров с поставщиками, партнерами и клиентами, включая международные поставки и дилерские контракты;',
                'Помощь в открытии банковских счетов и обслуживании банковских операций;',
                'Юридическая поддержка при решении споров с государственными органами или другими компаниями в Узбекистане.',
            ],
        },
        {
            name: 'Индия',
            info:
                'Индия – 6-ая экономика мира по ВВП. Индия имеет колоссальный внутренний рынок, сложившуюся правовую базу на основе английского права, а также опыт международной торговли и осуществления финансовых операций.',
            localizationName: 'Локализация в Индии:',
            localization: [
                'Консультации по вопросам местного законодательства, включая вопросы регистрации и ведения бизнеса;',
                'Налоговый консалтинг и структурирование финансовых потоков;',
                'Разработка юридических структур под нужды бизнеса в Индии, включая использование номинальных директоров и акционеров;',
                'Подготовка документов для регистрации компании в Индии, включая оформление учредительных документов, регистрацию и получение необходимых разрешений;',
                'Помощь в поиске и выборе подходящего офиса или склада для бизнеса;',
                'Подготовка договоров с поставщиками, партнерами и клиентами, включая международные поставки и дилерские контракты;',
                'Помощь в открытии банковских счетов и обслуживании банковских операций;',
                'Юридическая поддержка при решении споров с государственными органами или другими компаниями в Индии.',
            ],
        },
        {
            name: 'Гонконг (Китай)',
            info:
                'Ведущий мировой финансовый центр, имеющий устойчивое правовое регулирование. Гонконг, являясь самостоятельным звеном в международной торговле, имеет тесные связи как с материковым Китаем, так и с финансовыми рынками Азии и Запада, что позволяет бизнесу достигать самых амбициозных целей.',
            localizationName: 'Локализация в Гонконге:',
            localization: [
                'Консультации по вопросам местного законодательства, включая вопросы регистрации и ведения бизнеса;',
                'Налоговый консалтинг и структурирование финансовых потоков;',
                'Разработка юридических структур под нужды бизнеса в Индии, включая использование номинальных директоров и акционеров;',
                'Подготовка документов для регистрации компании в Индии, включая оформление учредительных документов, регистрацию и получение необходимых разрешений;',
                'Помощь в поиске и выборе подходящего офиса или склада для бизнеса;',
                'Подготовка договоров с поставщиками, партнерами и клиентами, включая международные поставки и дилерские контракты;',
                'Помощь в открытии банковских счетов и обслуживании банковских операций;',
            ],
        },
        {
            name: 'Локализация в иных юрисдикциях',
            info:
                'SQN сопровождает сделки по локализации бизнеса и в иных юрисдикциях. Опишите нам задачу вашего бизнеса, а мы подготовим подходящее решение.',
            localizationName: '',
            localization: [],
            button: 'Контакты',
        },
    ];

    React.useEffect(() => {
        window.scrollTo(0, 0);
    }, []);
    const bottomBlockRef = React.useRef(null);

    const scrollToBottom = () => {
        bottomBlockRef.current.scrollIntoView({ behavior: 'smooth' });
    };

    return (
        <>
            <SideBar />
            <motion.div
                initial="hidden"
                whileInView="visible"
                viewport={{ amount: 0.2, once: true }}
                className={s.investment}>
                <div className={s.investment__container}>
                    <div className={s.Bg}></div>
                    <button onClick={scrollToBottom} className="arrow">
                        <svg class="w-5 h-5 xl:w-6 xl:h-6" xmlns="http://www.w3.org/2000/svg" width="36" height="36" viewBox="0 0 36 36">
                            <g>
                                <polygon points="0 0 0 21.38 18 36 36 21.38 36 0 29.25 0 29.25 18 18 27 6.75 18 6.75 0 0 0" fill="#ffffff"></polygon>
                            </g>
                        </svg>
                    </button>
                    <div className={s.container}>
                        <div className={s.investment__title}>
                            <motion.h1
                                custom={1} variants={textAnimation}
                            >Международная практика</motion.h1>
                        </div>
                    </div>
                </div>
                <div ref={bottomBlockRef} className='container'>
                    <h3 className={s.information__title}><span>Локализация</span> - это процесс адаптации бизнеса к местным условиям в иной юрисдикции. Помимо создания бизнес-юнитов в новом месте, локализация также может включать юридическую поддержку запуска продукта в новом регионе, выстраивание системы международных расчетов, сопровождение сделок по приобретению активов в зарубежных юрисдикциях.</h3>
                    <p className={s.information__subtitle}><span>SQN оказывает услуги по локализации в следующих юрисдикциях:</span> ОАЭ, Саудовская Аравия, Оман, Иордания, Индия, Узбекистан, Казахстан, Гонконг (Китай). Мы также сопровождаем проекты по созданию юридических лиц в оффшорных юрисдикциях по выбору клиентов (с учетом существующих санкционных ограничений).</p>
                    <div className={s.countries}>
                        {countries.map((country, index) => (
                            <div onClick={() => toggleExpansion(index)} className={`${s.country} ${isCountryExpanded(index) ? s.expanded : ''}`} key={index}>
                                <h2 >{country.name}</h2>

                                <div className={s.contentWrapper}>
                                    {isCountryExpanded(index) && (
                                        <div className={s.content}>
                                            <p className={s.content__info}>{country.info}</p>
                                            <p className={s.content__localizationName}>{country.localizationName}</p>
                                            <ul>
                                                {country.localization.map((item, index) => (
                                                    <li className={s.content__localization} key={index}>{item}</li>
                                                ))}
                                            </ul>
                                            {index === 5 && (
                                                <Link to="/Contacts" className={s.content__button}>{country.button}</Link>
                                            )}
                                        </div>
                                    )}
                                </div>
                            </div>
                        ))}
                    </div>

                </div>
                <div className={s.backToHome}>
                    <Link to="/">Вернуться на главную</Link>
                </div>
            </motion.div>
            <Footer />
        </>
    )
}
